In [1]:
import pandas as pd
frame = pd.read_clipboard()
#클립보드에 있는 것을 불러올 수 있다.

In [3]:
frame.describe()

                earn       height           ed          age
count    1192.000000  1192.000000  1192.000000  1192.000000
mean    23154.773490    66.915154    13.504195    41.378356
std     19472.296925     3.853968     2.420175    15.867428
min       200.000000    57.503219     3.000000    18.000000
25%     10000.000000    64.009746    12.000000    29.000000
50%     20000.000000    66.451265    13.000000    38.000000
75%     30000.000000    69.848100    16.000000    51.000000
max    200000.000000    77.051282    18.000000    91.000000

In [4]:
frame.head()

      earn     height     sex  ed  age   race
0  50000.0  74.424439    male  16   45  white
1  60000.0  65.537543  female  16   58  white
2  30000.0  63.629198  female  16   29  white
3  50000.0  63.108562  female  16   91  other
4  51000.0  63.402484  female  17   39  white

In [5]:
frame.index

RangeIndex(start=0, stop=1192, step=1)

In [6]:
frame.columns

Index(['earn', 'height', 'sex', 'ed', 'age', 'race'], dtype='object')

In [7]:
frame.index = frame.race

In [11]:
frame2 = frame.set_index(['sex','race'], drop=False)
frame2

                 earn     height     sex  ed  age   race
sex    race
male   white  50000.0  74.424439    male  16   45  white
female white  60000.0  65.537543  female  16   58  white
       white  30000.0  63.629198  female  16   29  white
       other  50000.0  63.108562  female  16   91  other
       white  51000.0  63.402484  female  17   39  white
...               ...        ...     ...  ..  ...    ...
male   white  19000.0  72.165733    male  12   29  white
female white  15000.0  61.135800  female  18   82  white
       white   8000.0  63.664164  female  12   33  white
male   white  60000.0  71.925836    male  12   50  white
       white   6000.0  68.368486    male  12   27  white

[1192 rows x 6 columns]

In [13]:
frame3 = frame.set_index(['earn','race'], drop=False)
frame3

                  earn     height     sex  ed  age   race
earn    race
50000.0 white  50000.0  74.424439    male  16   45  white
60000.0 white  60000.0  65.537543  female  16   58  white
30000.0 white  30000.0  63.629198  female  16   29  white
50000.0 other  50000.0  63.108562  female  16   91  other
51000.0 white  51000.0  63.402484  female  17   39  white
...                ...        ...     ...  ..  ...    ...
19000.0 white  19000.0  72.165733    male  12   29  white
15000.0 white  15000.0  61.135800  female  18   82  white
8000.0  white   8000.0  63.664164  female  12   33  white
60000.0 white  60000.0  71.925836    male  12   50  white
6000.0  white   6000.0  68.368486    male  12   27  white

[1192 rows x 6 columns]

In [21]:
frame3.sort_index('race')

ValueError: No axis named race for object type <class 'pandas.core.frame.DataFrame'>

In [18]:
frame3['earn'].max()
frame3['earn'].idxmax()

(200000.0, 'white')

In [23]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
frame.to_pickle('frame.pickle')

In [26]:
pd.read_pickle('frame.pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [31]:
print(open('ex5.csv').read())

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [30]:
pd.read_csv('ex4.csv',skiprows=[0,2,3])

Empty DataFrame
Columns: [one, 1, 2, 3, 4, NA]
Index: []

In [33]:
result = pd.read_csv('ex5.csv')
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [34]:
pd.read_csv('ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
# 1. 데이터를 읽을 때 최대한 정리해서 읽기 (skiprows)
# 2. 누락값 여부 확인 (isnull)
# 3. 구조(shpae) 확인
# 4. 요약통계 (describe) 확인

In [37]:
sentinels = {'message' : ['foo','NA'],
            'something':['two']}
pd.read_csv('ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [38]:
# 큰 데이터의 처리
pd.read_csv('ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [42]:
from pandas import Series, DataFrame
chunker = pd.read_csv('ex6.csv', chunksize=1000)
tot = Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)
tot[:5]

C:\Users\user\anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
dtype: float64

In [47]:
data = pd.read_csv('ex5.csv', na_values=sentinels)
data.to_csv('out.csv')

In [50]:
import sys
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,NULL,5,6,NULL,8,world
2,three,9,10,11.0,12,NULL

In [45]:
d1 = pd.read_excel('ex1.xlsx')

In [46]:
d1

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [51]:
#unnamed는 원래 없던 것인데 생겨난 것이다.
d1.to

AttributeError: 'DataFrame' object has no attribute 'to'

In [52]:
dates = pd.date_range('21/10/2000',periods=7)

In [53]:
dates

DatetimeIndex(['2000-10-21', '2000-10-22', '2000-10-23', '2000-10-24',
               '2000-10-25', '2000-10-26', '2000-10-27'],
              dtype='datetime64[ns]', freq='D')

In [54]:
left = pd.DataFrame({'A' : [1,2], 'B' : [1,2]})
right= pd.DataFrame({'A' : [4,5,6], 'B': [2,2,2]})
pd.merge(left,right, on='B', how='outer', validate="one_to_many")

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

In [58]:
df1 = pd.DataFrame({'col1' : [0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1' : [1,2,3], 'col_right':['2','2','2']})
pd.merge(df1,df2, on='col1', how='outer', indicator= True)

   col1 col_left col_right      _merge
0     0        a       NaN   left_only
1     1        b         2        both
2     2      NaN         2  right_only
3     3      NaN         2  right_only